module.exports = {
    4: { location: '浙江省台州市玉环县坎门镇', position: [121.2764, 28.0974] },
    8: { location: '浙江省宁波市象山县爵溪镇', position: [121.9474, 29.4757] },
    10: { location: '福建省泉州市晋江市东石镇', position: [118.4826, 24.6594] },
    13: { location: '广东省汕尾市海丰县小漠镇', position: [115.0174, 22.7558] },
    16: {
        location: '海南省陵水黎族自治县光坡镇',
        position: [110.045, 18.5455],
    },
    102: { location: '福建省福州市福清市沙埔镇', position: [119.5132, 25.402] },
    103: {
        location: '广东省湛江市麻章区东简镇',
        position: [110.493, 21.0168],
    },
    104: {
        location: '广东省汕尾市海丰县小漠镇',
        position: [115.0174, 22.7558],
    },
    105: { location: '台湾省台东县大武乡', position: [120.8973, 22.3777] },
    107: {
        location: '广东省茂名市电白县博贺镇',
        position: [111.1837, 21.4882],
    },
    108: {
        location: '福建省福州市连江县筱埕镇',
        position: [119.7734, 26.3109],
    },
    114: { location: '海南省三亚市林旺镇', position: [109.7602, 18.3158] },
    116: {
        location: '广东省汕尾市陆丰市甲东镇',
        position: [116.1338, 22.8768],
    },
    119: { location: '台湾省台东县大武乡', position: [120.8973, 22.3777] },
    208: { location: '台湾省台中市大安区', position: [121.9637, 24.084] },
    209: {
        location: '山东省青岛市胶南市灵山卫镇',
        position: [120.1351, 35.9321],
    },
    212: { location: '广东省汕尾市陆丰市金厢镇', position: [115.7339, 22.873] },
    214: {
        location: '广东省湛江市坡头区乾塘镇',
        position: [110.6046, 21.2581],
    },
    216: {
        location: '浙江省温州市苍南县金乡镇',
        position: [120.6151, 27.4236],
    },
    218: { location: '广东省阳江市江城区海陵镇', position: [111.9333, 21.628] },
    220: {
        location: '海南省三亚市崖城镇',
        position: [109.1677, 18.3592],
    },
    307: { location: '海南省万宁市北坡镇', position: [110.4512, 18.7943] },
    308: {
        location: '广东省茂名市电白县博贺镇',
        position: [111.1837, 21.4882],
    },
    309: { location: '福建省厦门市思明区滨海镇', position: [118.077, 24.4482] },
    311: {
        location: '海南省文昌市翁田镇',
        position: [110.885, 19.92],
    },
    312: {
        location: '浙江省温州市平阳县鳌江镇',
        position: [120.5547, 27.5966],
    },
    313: {
        location: '广东省惠州市惠东县港口镇',
        position: [114.8964, 22.5733],
    },
    320: {
        location: '海南省乐东黎族自治县莺歌海镇',
        position: [109.1699, 18.7515],
    },
    407: {
        location: '浙江省温州市乐清市黄华镇',
        position: [120.9256, 27.9944],
    },
    409: { location: '香港特别行政区', position: [114.1746, 22.2907] },
    413: { location: '浙江省台州市温岭市石塘镇', position: [121.6029, 28.28] },
    417: {
        location: '福建省泉州市惠安县崇武镇',
        position: [118.9149, 24.8952],
    },
    420: {
        location: '浙江省温州市龙湾区永强镇',
        position: [120.8197, 27.9198],
    },
    424: { location: '台湾省新北市贡寮区', position: [121.9127, 25.041] },
    427: { location: '台湾省屏东县枋寮乡', position: [119.2972, 26.104] },
    505: { location: '台湾省宜兰县苏澳镇', position: [121.8565, 24.5441] },
    508: { location: '海南省琼海市博鳌镇', position: [110.5823, 19.1617] },
    509: {
        location: '浙江省台州市玉环县干江镇',
        position: [121.3495, 28.1745],
    },
    510: { location: '广东省汕头市潮阳区海门镇', position: [116.6106, 23.186] },
    513: { location: '福建省福州市福清市沙埔镇', position: [119.5132, 25.402] },
    515: {
        location: '浙江省台州市路桥区金清镇',
        position: [121.5576, 28.5173],
    },
    518: { location: '海南省万宁市山根镇', position: [110.4822, 18.9691] },
    519: {
        location: '福建省泉州市南安市石井镇',
        position: [118.3819, 24.6337],
    },
    601: { location: '广东省汕头市南澳县云澳镇', position: [117.1007, 23.41] },
    602: { location: '广东省湛江市麻章区东简镇', position: [110.493, 21.0168] },
    604: {
        location: '福建省福州市连江县筱埕镇',
        position: [119.7734, 26.3109],
    },
    605: {
        location: '福建省泉州市晋江市围头镇',
        position: [118.5475, 24.7845],
    },
    606: {
        location: '广东省茂名市电白县爵山镇',
        position: [111.3356, 21.4978],
    },
    608: { location: '浙江省温州市苍南县马站镇', position: [120.459, 27.2672] },
    609: { location: '台湾省台东县成功镇', position: [121.3516, 23.1061] },
    703: {
        location: '海南省万宁市东澳镇',
        position: [110.3886, 18.7954],
    },
    706: {
        location: '广东省珠海市香洲区唐家湾镇',
        position: [113.5551, 22.3664],
    },
    707: { location: '台湾省台东县长滨乡', position: [121.4332, 23.3286] },
    708: {
        location: '福建省泉州市惠安县崇武镇',
        position: [118.9149, 24.8952],
    },
    712: {
        location: '浙江省温州市苍南县霞关镇',
        position: [120.4681, 27.1723],
    },
    713: { location: '海南省文昌市昌洒镇', position: [110.7936, 19.545] },
    715: { location: '浙江省温州市苍南', position: [120.4227, 27.5204] },
    801: {
        location: '海南省文昌市龙楼镇',
        position: [110.9615, 19.6516],
    },
    806: { location: '广东省深圳市龙岗区葵涌镇', position: [114.419, 22.6332] },
    807: {
        location: '福建省宁德市霞浦县下浒镇',
        position: [120.0067, 26.6325],
    },
    808: {
        location: '福建省福州市福清市东瀚镇',
        position: [119.6177, 25.4069],
    },
    809: {
        location: '广东省阳江市阳西县溪头镇',
        position: [111.7527, 21.6557],
    },
    812: {
        location: '香港特别行政区',
        position: [114.1746, 22.2907],
    },
    813: { location: '台湾省宜兰县五结乡', position: [121.8093, 24.6801] },
    814: {
        location: '广东省茂名市电白县陈村镇',
        position: [111.0563, 21.5299],
    },
    815: { location: '台湾省宜兰县南澳乡', position: [121.6302, 24.4657] },
    817: {
        location: '海南省文昌市龙楼镇',
        position: [110.9615, 19.6516],
    },
    903: {
        location: '福建省泉州市晋江市金井镇',
        position: [118.6059, 24.5726],
    },
    904: {
        location: '广东省惠州市惠阳区霞涌镇',
        position: [114.6547, 22.7727],
    },
    905: { location: '海南省文昌市翁田镇', position: [110.885, 19.92] },
    906: {
        location: '广东省深圳市龙岗区大鹏半岛',
        position: [114.4858, 22.5505],
    },
    907: {
        location: '广东省江门市台山市川岛镇',
        position: [112.6873, 21.8509],
    },
    908: {
        location: '福建省宁德市霞浦县北壁乡',
        position: [119.8929, 26.5661],
    },
    913: { location: '海南省文昌市龙楼镇', position: [110.9615, 19.6516] },
    915: {
        location: '广东省江门市台山市北陡镇',
        position: [112.3989, 21.8758],
    },
    917: { location: '海南省万宁市龙滚镇', position: [110.4905, 19.047] },
    1002: {
        location: '海南省三亚市亚龙湾度假区',
        position: [109.6396, 18.2341],
    },
    1003: {
        location: '广东省湛江市吴川市吴阳镇',
        position: [110.6616, 21.3152],
    },
    1006: {
        location: '福建省漳州市漳浦县古雷镇',
        position: [117.6224, 23.8029],
    },
    1008: {
        location: '福建省泉州市惠安县崇武镇',
        position: [118.9149, 24.8952],
    },
    1010: {
        location: '福建省泉州市石狮市永宁镇',
        position: [118.6893, 24.6994],
    },
    1011: {
        location: '福建省漳州市漳浦县古雷镇',
        position: [117.6224, 23.8029],
    },
    1013: {
        location: '福建省漳州市漳浦县六鳌镇',
        position: [117.7695, 23.9586],
    },
    1103: {
        location: '广东省汕头市澄海区坝头镇',
        position: [116.8238, 23.443],
    },
    1104: {
        location: '广东省湛江市吴川市吴阳镇',
        position: [110.6616, 21.3152],
    },
    1105: {
        location: '山东省威海市荣成市成山镇',
        position: [122.5341, 37.3643],
    },
    1108: { location: '海南省文昌市龙楼镇', position: [110.9615, 19.6516] },
    1111: {
        location: '福建省泉州市晋江市陈埭镇',
        position: [118.6045, 24.8467],
    },
    1117: {
        location: '海南省文昌市翁田镇',
        position: [110.885, 19.92],
    },
    1119: { location: '海南省万宁市东澳镇', position: [110.3886, 18.7954] },
    1206: {
        location: '广东省珠海市金湾区南水镇',
        position: [113.2353, 22.0294],
    },
    1208: {
        location: '广东省江门市台山市赤溪镇',
        position: [112.9844, 21.9936],
    },
    1209: {
        location: '福建省宁德市福鼎市秦屿镇',
        position: [120.2476, 27.1057],
    },
    1210: {
        location: '江苏省盐城市响水县陈家港镇',
        position: [119.7758, 34.3351],
    },
    1211: {
        location: '浙江省宁波市象山县鹤浦镇',
        position: [121.8944, 29.1523],
    },
    1213: {
        location: '广东省湛江市麻章区东简镇',
        position: [110.493, 21.0168],
    },
    1214: { location: '台湾省屏东县牡丹乡', position: [119.2972, 26.104] },
    1305: { location: '海南省琼海市潭门镇', position: [110.6116, 19.2422] },
    1306: {
        location: '广东省湛江市麻章区民安镇',
        position: [110.3211, 21.0147],
    },
    1307: {
        location: '福建省福州市连江县晓澳镇',
        position: [119.6446, 26.2218],
    },
    1308: {
        location: '福建省漳州市漳浦县前亭镇',
        position: [117.9834, 24.2312],
    },
    1309: { location: '海南省文昌市东郊镇', position: [110.8551, 19.5793] },
    1311: {
        location: '广东省阳江市江城区海陵镇',
        position: [111.9333, 21.628],
    },
    1312: {
        location: '福建省福州市福清市海口镇',
        position: [119.4487, 25.6878],
    },
    1319: {
        location: '广东省汕尾市捷胜镇沿海地区',
        position: [115.4344, 22.7131],
    },
    1323: {
        location: '福建省宁德市福鼎市沙埕镇',
        position: [120.4161, 27.1636],
    },
    1407: {
        location: '广东省汕头市濠江区河浦镇',
        position: [116.6569, 23.273],
    },
    1409: {
        location: '海南省文昌市翁田镇',
        position: [110.885, 19.92],
    },
    1410: {
        location: '福建省福州市福清市高山镇',
        position: [119.562, 25.488],
    },
    1415: {
        location: '海南省文昌市翁田镇',
        position: [110.885, 19.92],
    },
    1416: {
        location: '浙江省宁波市象山县鹤浦镇',
        position: [121.8944, 29.1523],
    },
    1508: { location: '海南省万宁市和乐镇', position: [110.4715, 18.9224] },
    1509: { location: '普陀区朱家尖', position: [122.3858, 29.9169] },
    1510: {
        location: '广东省汕尾市陆丰市甲东镇',
        position: [116.1338, 22.8768],
    },
    1513: {
        location: '福建省莆田市秀屿区山亭镇',
        position: [119.1133, 25.1459],
    },
    1521: {
        location: '福建省莆田市秀屿区山亭镇',
        position: [119.1133, 25.1459],
    },
    1522: {
        location: '广东省湛江市坡头区南三镇',
        position: [110.561, 21.1517],
    },
    1601: { location: '福建省石狮市', position: [118.6435, 24.7347] },
    1603: { location: '海南省万宁市东澳镇', position: [110.3886, 18.7954] },
    1604: { location: '广东省深圳市大鹏半岛', position: [114.4858, 22.5505] },
    1608: { location: '广东省湛江雷州市东里镇', position: [110.3598, 20.7778] },
    1614: { location: '福建省厦门市翔安区', position: [118.2433, 24.6213] },
    1617: { location: '福建省泉州市惠安县', position: [118.7924, 25.0334] },
    1621: { location: '海南省万宁市和乐镇', position: [110.4715, 18.9224] },
    1622: {
        location: '广东省汕尾市海丰县鲘门镇',
        position: [115.0883, 22.8064],
    },
    1702: { location: '广东省深圳市大鹏半岛', position: [114.4858, 22.5505] },
    1709: { location: '福建省福清市', position: [119.3791, 25.7228] },
    1713: { location: '广东省珠海市金湾区', position: [113.3576, 22.1493] },
    1714: { location: '广东省台山市', position: [112.7889, 22.2545] },
    1720: { location: '广东省徐闻县', position: [110.1717, 20.3278] },
    1804: {
        location: '广东省湛江市徐闻县新寮镇',
        position: [110.4595, 20.6255],
    },
    1808: { location: '福建连江黄岐半岛', position: [119.8738, 26.329] },
    1810: { location: '上海市崇明岛', position: [121.5449, 31.6302] },
    1822: {
        location: '广东省江门市台山市端芬镇',
        position: [112.751, 22.0536],
    },
    4905: {
        location: '浙江省舟山市普陀区朱家尖',
        position: [122.3858, 29.9169],
    },
    4907: { location: '台湾省屏东县林边乡', position: [119.2972, 26.104] },
    4912: {
        location: '广东省汕头市潮阳区海门镇',
        position: [116.6106, 23.186],
    },
    4913: {
        location: '广东省汕头市龙湖区新溪镇',
        position: [116.7881, 23.3874],
    },
    5003: {
        location: '辽宁省丹东市东港市前阳镇',
        position: [124.1915, 39.9755],
    },
    5012: {
        location: '广东省湛江市麻章区东简镇',
        position: [110.493, 21.0168],
    },
    5017: { location: '海南省万宁市东澳镇', position: [110.3886, 18.7954] },
    5106: {
        location: '广东省湛江市吴川市王村港镇',
        position: [110.9315, 21.4276],
    },
    5108: { location: '海南省文昌市东郊镇', position: [110.8551, 19.5793] },
    5109: {
        location: '广东省湛江市雷州市东里镇',
        position: [110.3598, 20.7778],
    },
    5110: {
        location: '浙江省台州市玉环县坎门镇',
        position: [121.2764, 28.0974],
    },
    5201: {
        location: '广东省茂名市电白区博贺镇',
        position: [111.1837, 21.4882],
    },
    5203: {
        location: '广东省湛江市吴川市王村港镇',
        position: [110.9315, 21.4276],
    },
    5205: { location: '浙江省台州市温岭市石塘镇', position: [121.6029, 28.28] },
    5206: {
        location: '广东省汕尾市陆丰市碣石镇',
        position: [115.8617, 22.8243],
    },
    5210: { location: '海南省万宁市山根镇', position: [110.4822, 18.9691] },
    5211: {
        location: '福建省福州市福清市东瀚镇',
        position: [119.6177, 25.4069],
    },
    5212: { location: '海南省文昌市翁田镇', position: [110.885, 19.92] },
    5221: { location: '台湾省高雄市林园乡', position: [121.9637, 24.084] },
    5223: { location: '台湾省云林县水林乡', position: [120.2403, 23.5685] },
    5303: {
        location: '福建省福州市福清市江阴镇',
        position: [119.3062, 25.4973],
    },
    5306: {
        location: '浙江省温州市乐清市蒲歧镇',
        position: [120.9819, 28.1154],
    },
    5307: { location: '海南省文昌市昌洒镇', position: [110.7936, 19.545] },
    5308: {
        location: '福建省莆田市涵江区白塘镇',
        position: [119.0847, 25.4485],
    },
    5309: {
        location: '广东省汕尾市海丰县小漠镇',
        position: [115.0174, 22.7558],
    },
    5310: {
        location: '广东省珠海市金湾区三灶镇',
        position: [113.3613, 22.0601],
    },
    5315: { location: '海南省文昌市东郊镇', position: [110.8551, 19.5793] },
    5401: {
        location: '海南省陵水黎族自治县英州镇',
        position: [109.8592, 18.4488],
    },
    5405: {
        location: '广东省湛江市麻章区东简镇',
        position: [110.493, 21.0168],
    },
    5412: {
        location: '广东省江门市台山市赤溪镇',
        position: [112.9844, 21.9936],
    },
    5413: {
        location: '广东省汕尾市海丰县小漠镇',
        position: [115.0174, 22.7558],
    },
    5504: {
        location: '广东省江门市台山市赤溪镇',
        position: [112.9844, 21.9936],
    },
    5505: {
        location: '山东省威海市乳山市海阳所镇',
        position: [121.5556, 36.7833],
    },
    5511: {
        location: '福建省漳州市龙海市港尾镇',
        position: [118.0797, 24.3423],
    },
    5513: { location: '海南省琼海市潭门镇', position: [110.6116, 19.2422] },
    5603: { location: '海南省万宁市龙滚镇', position: [110.4905, 19.047] },
    5608: {
        location: '福建省福州市长乐市金峰镇',
        position: [119.5986, 25.9726],
    },
    5610: {
        location: '福建省漳州市龙海市港尾镇',
        position: [118.0797, 24.3423],
    },
    5611: {
        location: '福建省泉州市惠安县东园镇',
        position: [118.7392, 24.9044],
    },
    5704: { location: '台湾省台东县成功镇', position: [121.3516, 23.1061] },
    5705: {
        location: '广东省深圳市龙岗区大鹏半岛',
        position: [114.4858, 22.5505],
    },
    5709: {
        location: '广东省潮州市饶平县大埕镇',
        position: [117.1562, 23.6207],
    },
    5711: {
        location: '广东省珠海市香洲区横琴镇',
        position: [113.5023, 22.1156],
    },
    5807: {
        location: '福建省厦门市翔安区大嶝小镇',
        position: [118.3353, 24.5584],
    },
    5813: {
        location: '福建省宁德市福鼎市店下镇',
        position: [120.3082, 27.1608],
    },
    5906: { location: '浙江省温州市苍南', position: [120.4227, 27.5204] },
    5910: {
        location: '福建省漳州市漳浦县赤湖镇',
        position: [117.8606, 24.0902],
    },
    5912: {
        location: '福建省泉州市惠安县崇武镇',
        position: [118.9149, 24.8952],
    },
    5913: {
        location: '福建省福州市连江县安凯乡',
        position: [119.8293, 26.3538],
    },
    5914: {
        location: '后海',
        position: [110.7, 21],
    },
    5925: { location: '台湾省屏东县恒春镇', position: [119.2972, 26.104] },
    6006: { location: '香港特别行政区', position: [114.1746, 22.2907] },
    6010: { location: '台湾省宜兰', position: [121.9637, 24.084] },
    6011: { location: '台北基隆', position: [121.7571, 25.1539] },
    6014: { location: '台湾宜兰', position: [121.9637, 24.084] },
    6024: { location: '海南文昌', position: [110.7936, 19.545] },
    6104: { location: '香港特别行政区', position: [114.1746, 22.2907] },
    6105: { location: '台湾台东县', position: [121.9637, 24.084] },
    6107: { location: '广东省汕头市', position: [116.6775, 23.356] },
    6108: { location: '广东省汕头市', position: [116.6775, 23.356] },
    6109: { location: '香港特别行政区', position: [114.1746, 22.2907] },
    6113: { location: '福建厦门', position: [118.085, 24.4817] },
    6115: { location: '福建龙海', position: [117.8132, 24.4497] },
    6117: { location: '广东海丰', position: [115.3181, 22.969] },
    6118: { location: '福建晋江', position: [118.5475, 24.7845] },
    6121: { location: '广东省深圳市', position: [114.0529, 22.5455] },
    6122: { location: '浙江三门', position: [120.1483, 30.2679] },
    6206: { location: '台湾台东县', position: [121.9637, 24.084] },
    6210: { location: '台湾宜兰', position: [121.9637, 24.084] },
    6211: { location: '海南文昌', position: [110.7936, 19.545] },
    6216: { location: '香港特别行政区', position: [114.1746, 22.2907] },
    6217: { location: '台湾花莲', position: [121.9637, 24.084] },
    6219: { location: '海南陵水', position: [110.0763, 18.5051] },
    6220: { location: '广东陆丰', position: [115.7769, 22.9644] },
    6305: { location: '广东澄海', position: [116.7514, 23.4686] },
    6307: { location: '福建连江黄岐半岛', position: [119.8738, 26.329] },
    6308: { location: '广东吴川', position: [110.7755, 21.4437] },
    6310: { location: '海南文昌', position: [110.7936, 19.545] },
    6313: { location: '海南文昌', position: [110.7936, 19.545] },
    6314: { location: '福建连江黄岐半岛', position: [119.8738, 26.329] },
    6402: { location: '广东斗门', position: [113.2917, 22.2121] },
    6403: { location: '海南琼海', position: [110.6146, 19.2409] },
    6411: { location: '辽宁普兰店', position: [121.9351, 39.3908] },
    6412: { location: '澳门', position: [113.5549, 22.1959] },
    6413: { location: '广东徐闻', position: [110.1717, 20.3278] },
    6419: { location: '广东珠海', position: [113.571, 22.2739] },
    6420: { location: '广东深圳', position: [114.0529, 22.5455] },
    6427: { location: '广东深圳', position: [114.0529, 22.5455] },
    6510: { location: '台湾台东县', position: [121.9637, 24.084] },
    6512: { location: '广东湛江', position: [110.3545, 21.2733] },
    6513: { location: '广东阳江', position: [111.9769, 21.8609] },
    6514: { location: '台湾台东县', position: [121.9637, 24.084] },
    6518: { location: '福建福清', position: [119.3791, 25.7228] },
    6519: { location: '海南琼海', position: [110.4714, 19.2549] },
    6523: { location: '广东电白', position: [113.2607, 23.1344] },
    6528: { location: '广东阳江', position: [111.9769, 21.8609] },
    6532: { location: '海南海口', position: [110.3147, 20.0403] },
    6603: { location: '台湾台南', position: [121.9637, 24.084] },
    6605: { location: '广东珠海', position: [113.571, 22.2739] },
    6606: { location: '广东台山', position: [112.7889, 22.2545] },
    6608: { location: '海南文昌', position: [110.7936, 19.545] },
    6609: { location: '海南三亚', position: [109.5079, 18.2547] },
    6612: { location: '福建连江黄岐半岛', position: [119.8738, 26.329] },
    6614: { location: '辽宁庄河', position: [122.9628, 39.6797] },
    6616: { location: '福建罗源', position: [119.2912, 26.1032] },
    6617: { location: '福建霞浦', position: [119.2912, 26.1032] },
    6619: { location: '台湾屏东', position: [121.9637, 24.084] },
    6706: { location: '广东潮阳', position: [116.5977, 23.2678] },
    6708: { location: '福建连江黄岐半岛', position: [119.8738, 26.329] },
    6709: { location: '山东乳山', position: [121.5352, 36.9186] },
    6711: { location: '广东电白', position: [113.2607, 23.1344] },
    6714: { location: '广东阳江', position: [111.9769, 21.8609] },
    6716: { location: '广东台山', position: [112.7889, 22.2545] },
    6719: { location: '福建漳浦', position: [119.2912, 26.1032] },
    6721: { location: '海南琼海', position: [110.4714, 19.2549] },
    6729: { location: '广东徐闻', position: [110.1717, 20.3278] },
    6731: { location: '广东湛江', position: [110.3545, 21.2733] },
    6733: { location: '台湾花莲', position: [121.9637, 24.084] },
    6805: { location: '海南万宁', position: [110.3886, 18.7954] },
    6809: { location: '香港特别行政区', position: [114.1746, 22.2907] },
    6812: { location: '广东湛江', position: [110.3545, 21.2733] },
    6814: { location: '海南文昌', position: [110.7936, 19.545] },
    6817: { location: '广东惠来', position: [116.2905, 23.0361] },
    6905: { location: '广东潮阳', position: [116.5977, 23.2678] },
    6908: { location: '福建连江黄岐半岛', position: [119.8738, 26.329] },
    6911: { location: '福建晋江', position: [118.5475, 24.7845] },
    7004: { location: '广东惠东', position: [114.7153, 22.9878] },
    7007: { location: '广东台山', position: [112.7889, 22.2545] },
    7012: { location: '福建莆田', position: [119.2912, 26.1032] },
    7014: { location: '广东海丰', position: [115.3181, 22.969] },
    7017: { location: '海南文昌', position: [110.7936, 19.545] },
    7104: { location: '海南乐东', position: [108.9495, 18.726] },
    7108: { location: '海南万宁', position: [110.3886, 18.7954] },
    7110: { location: '广东珠海', position: [113.571, 22.2739] },
    7111: { location: '海南文昌', position: [110.7936, 19.545] },
    7115: { location: '海南三亚', position: [109.5079, 18.2547] },
    7116: { location: '广东惠东', position: [114.7153, 22.9878] },
    7118: { location: '福建晋江', position: [118.5475, 24.7845] },
    7121: { location: '广东番禺', position: [113.3785, 22.9402] },
    7126: { location: '福建惠安', position: [118.7924, 25.0334] },
    7127: { location: '福建连江黄岐半岛', position: [119.8738, 26.329] },
    7129: { location: '海南万宁', position: [110.3886, 18.7954] },
    7130: { location: '海南三亚', position: [109.5079, 18.2547] },
    7205: { location: '广东电白', position: [113.2607, 23.1344] },
    7206: { location: '山东荣成', position: [122.4812, 37.1646] },
    7207: { location: '福建惠安', position: [118.7924, 25.0334] },
    7211: { location: '浙江苍南', position: [120.1483, 30.2679] },
    7213: { location: '浙江苍南', position: [120.1483, 30.2679] },
    7214: { location: '海南文昌', position: [110.7936, 19.545] },
    7226: { location: '海南文昌', position: [110.7936, 19.545] },
    7301: { location: '福建厦门', position: [118.085, 24.4817] },
    7303: { location: '山东海阳', position: [121.169, 36.6868] },
    7304: { location: '广东深圳', position: [114.0529, 22.5455] },
    7308: { location: '广东电白', position: [113.2607, 23.1344] },
    7311: { location: '广东徐闻', position: [110.1717, 20.3278] },
    7312: { location: '海南文昌', position: [110.7936, 19.545] },
    7313: { location: '广东电白', position: [113.2607, 23.1344] },
    7314: { location: '海南琼海', position: [110.4714, 19.2549] },
    7315: { location: '福建龙海', position: [117.8132, 24.4497] },
    7318: { location: '海南三亚', position: [109.5079, 18.2547] },
    7405: { location: '海南省文昌市东郊镇', position: [110.8551, 19.5793] },
    7410: { location: '浙江省台州市温岭市石塘镇', position: [121.6029, 28.28] },
    7411: {
        location: '广东省阳江市阳西县沙扒镇',
        position: [111.4848, 21.5211],
    },
    7413: {
        location: '福建省泉州市惠安县张坂镇',
        position: [118.8116, 24.9106],
    },
    7414: {
        location: '浙江省台州市三门县三角塘',
        position: [121.3915, 29.1072],
    },
    7420: { location: '台湾省宜兰县头城镇', position: [121.8278, 24.8988] },
    7422: { location: '海南省文昌市会文镇', position: [110.718, 19.4562] },
    7424: { location: '海南省万宁市后安镇', position: [110.3886, 18.7954] },
    7429: {
        location: '广东省江门市台山市赤溪镇',
        position: [112.9844, 21.9936],
    },
    7503: {
        location: '福建省泉州市晋江市深沪镇',
        position: [118.6441, 24.6324],
    },
    7504: { location: '浙江省台州市温岭市石塘镇', position: [121.6029, 28.28] },
    7511: { location: '海南省万宁市山根镇', position: [110.4822, 18.9691] },
    7512: {
        location: '广东省潮州市饶平县大埕镇',
        position: [117.1562, 23.6207],
    },
    7514: {
        location: '广东省江门市台山市海宴镇',
        position: [112.5906, 21.834],
    },
    7515: {
        location: '广东省珠海市金湾区三灶镇',
        position: [113.3613, 22.0601],
    },
    7516: {
        location: '广东省湛江市吴川市王村港镇',
        position: [110.9315, 21.4276],
    },
    7610: {
        location: '广东省阳江市江城区海陵镇',
        position: [111.9333, 21.628],
    },
    7613: {
        location: '福建省莆田市秀屿区东峤镇',
        position: [119.1711, 25.2565],
    },
    7614: {
        location: '广东省江门市台山市川岛镇',
        position: [112.6873, 21.8509],
    },
    7616: {
        location: '广东省惠州市惠东县盐洲镇',
        position: [114.9391, 22.727],
    },
    7619: {
        location: '广东省湛江市吴川市吴阳镇',
        position: [110.6616, 21.3152],
    },
    7702: {
        location: '福建省泉州市惠安县崇武镇',
        position: [118.9149, 24.8952],
    },
    7703: { location: '海南省琼海市博鳌镇', position: [110.5823, 19.1617] },
    7704: {
        location: '福建省福州市福清市东瀚镇',
        position: [119.6177, 25.4069],
    },
    7705: {
        location: '福建省泉州市惠安县小岞镇',
        position: [118.9973, 24.9525],
    },
    7709: { location: '上海市崇明县向化镇', position: [121.5245, 31.6296] },
    7712: {
        location: '广东省阳江市阳西县上洋镇',
        position: [111.5775, 21.591],
    },
    7804: { location: '台湾省花莲县寿丰乡', position: [121.5196, 23.8397] },
    7806: {
        location: '浙江省台州市三门县键跳镇',
        position: [121.3915, 29.1072],
    },
    7809: {
        location: '广东省惠州市惠东县铁涌镇',
        position: [114.8503, 22.7189],
    },
    7810: {
        location: '海南省三亚市亚龙湾度假区',
        position: [109.6396, 18.2341],
    },
    7812: {
        location: '福建省莆田市秀屿区埭头镇',
        position: [119.2796, 25.2819],
    },
    7813: {
        location: '广东省湛江市坡头区南三镇',
        position: [110.561, 21.1517],
    },
    7820: { location: '海南省文昌市会文镇', position: [110.718, 19.4562] },
    7905: {
        location: '广东省湛江市坡头区乾塘镇',
        position: [110.6046, 21.2581],
    },
    7907: {
        location: '广东省深圳市龙岗区大鹏半岛',
        position: [114.4858, 22.5505],
    },
    7908: {
        location: '广东省汕尾市陆丰市甲东镇',
        position: [116.1338, 22.8768],
    },
    7910: {
        location: '浙江省舟山市普陀区沈家门',
        position: [122.2967, 29.9478],
    },
    7913: {
        location: '广东省珠海市金湾区横琴镇',
        position: [113.5023, 22.1156],
    },
    7914: { location: '海南省万宁市和乐镇', position: [110.4715, 18.9224] },
    8005: {
        location: '广东省揭阳市惠来县神泉镇',
        position: [116.3183, 22.9768],
    },
    8006: {
        location: '海南省陵水黎族自治县光坡镇',
        position: [110.045, 18.5455],
    },
    8007: {
        location: '广东省汕头市濠江区乌鹿坑',
        position: [116.7878, 23.2198],
    },
    8008: {
        location: '广东省湛江市徐闻县角尾乡',
        position: [109.956, 20.2819],
    },
    8009: {
        location: '广东省汕尾市陆丰市湖东镇',
        position: [115.9588, 22.8366],
    },
    8012: {
        location: '福建省福州市平潭县澳前镇',
        position: [119.8192, 25.477],
    },
    8014: { location: '海南省文昌市会文镇', position: [110.718, 19.4562] },
    8015: {
        location: '福建省漳州市漳浦县古雷镇',
        position: [117.6224, 23.8029],
    },
    8104: { location: '台湾省屏东县林边乡', position: [119.2972, 26.104] },
    8105: { location: '台湾省宜兰县南澳乡', position: [121.6302, 24.4657] },
    8106: {
        location: '海南省三亚市亚龙湾度假区',
        position: [109.6396, 18.2341],
    },
    8107: {
        location: '广东省江门市台山市川岛镇',
        position: [112.6873, 21.8509],
    },
    8108: {
        location: '福建省福州市长乐市江田镇',
        position: [119.5314, 25.8053],
    },
    8111: { location: '海南省万宁市和乐镇', position: [110.4715, 18.9224] },
    8114: { location: '海南省万宁市东澳镇', position: [110.3886, 18.7954] },
    8118: {
        location: '广东省汕尾市陆丰市湖东镇',
        position: [115.9588, 22.8366],
    },
    8123: { location: '海南省三亚市海棠区', position: [109.7129, 18.3337] },
    8209: {
        location: '广东省湛江市雷州市沈塘镇',
        position: [110.091, 21.0089],
    },
    8210: {
        location: '福建省莆田市秀屿区东峤镇',
        position: [119.1711, 25.2565],
    },
    8213: {
        location: '福建省漳州市漳浦县六鳌镇',
        position: [117.7695, 23.9586],
    },
    8219: {
        location: '海南省文昌市翁田镇',
        position: [110.885, 19.92],
    },
    8302: {
        location: '海南省文昌市翁田镇',
        position: [110.885, 19.92],
    },
    8303: { location: '海南省文昌市会文镇', position: [110.718, 19.4562] },
    8304: {
        location: '福建省漳州市漳浦县六鳌镇',
        position: [117.7695, 23.9586],
    },
    8309: {
        location: '广东省珠海市香洲区吉大沿海',
        position: [113.5731, 22.2531],
    },
    8311: { location: '海南省文昌市东郊镇', position: [110.8551, 19.5793] },
    8314: {
        location: '广东省阳江市阳东县东平镇',
        position: [112.2506, 21.7545],
    },
    8402: {
        location: '广东省茂名市电白县爵山镇',
        position: [111.3356, 21.4978],
    },
    8404: {
        location: '广东省阳江市阳西县溪头镇',
        position: [111.7527, 21.6557],
    },
    8407: {
        location: '江苏省南通市如东县长沙镇',
        position: [121.283, 32.4093],
    },
    8408: {
        location: '福建省福州市连江县苔菉镇',
        position: [119.9347, 26.3588],
    },
    8409: {
        location: '广东省深圳市龙岗区大鹏半岛',
        position: [110.718, 19.4562],
    },
    8411: {
        location: '海南省文昌市会文镇',
        position: [108.7639, 21.7218],
    },
    8412: {
        location: '广东省汕尾市陆丰市甲东镇',
        position: [116.1338, 22.8768],
    },
    8504: {
        location: '广东省汕尾市马宫镇沿海地区',
        position: [115.2482, 22.7975],
    },
    8506: {
        location: '浙江省台州市玉环县坎门镇',
        position: [121.2764, 28.0974],
    },
    8509: {
        location: '江苏省南通市启东市寅阳镇',
        position: [121.8281, 31.6847],
    },
    8510: {
        location: '福建省福州市福清市城头镇',
        position: [119.5183, 25.7239],
    },
    8515: {
        location: '广东省阳江市阳东县东平镇',
        position: [112.2506, 21.7545],
    },
    8517: {
        location: '广东省湛江市麻章区东简镇',
        position: [110.493, 21.0168],
    },
    8518: { location: '海南省万宁市东澳镇', position: [110.3886, 18.7954] },
    8521: {
        location: '海南省三亚市亚龙湾度假区',
        position: [109.6396, 18.2341],
    },
    8603: {
        location: '海南省三亚市亚龙湾度假区',
        position: [109.6396, 18.2341],
    },
    8605: { location: '台湾省花莲县秀林乡', position: [121.4662, 24.0946] },
    8607: {
        location: '广东省汕尾市捷胜镇沿海地区',
        position: [115.4344, 22.7131],
    },
    8613: { location: '海南省文昌市锦山镇', position: [110.7045, 19.9626] },
    8614: { location: '台湾省台东县长滨乡', position: [121.4332, 23.3286] },
    8618: {
        location: '广东省湛江市坡头区南三镇',
        position: [110.561, 21.1517],
    },
    8703: {
        location: '广东省阳江市阳西县沙扒镇',
        position: [111.4848, 21.5211],
    },
    8706: { location: '台湾省宜兰县南澳乡', position: [121.6302, 24.4657] },
    8708: {
        location: '浙江省温州市龙湾区海城镇',
        position: [120.7563, 27.8311],
    },
    8710: {
        location: '海南省三亚市崖州区南山文化旅游区',
        position: [109.2035, 18.2932],
    },
    8712: {
        location: '福建省泉州市晋江市深沪镇',
        position: [118.6441, 24.6324],
    },
    8719: {
        location: '广东省珠海市金湾区横琴镇',
        position: [113.5023, 22.1156],
    },
    8802: { location: '台湾省屏东县车城乡', position: [119.2972, 26.104] },
    8804: {
        location: '广东省江门市台山市赤溪镇',
        position: [112.9844, 21.9936],
    },
    8805: {
        location: '广东省汕尾市陆丰市甲东镇',
        position: [116.1338, 22.8768],
    },
    8807: {
        location: '浙江省宁波市象山县丹城镇',
        position: [121.8747, 29.4679],
    },
    8817: {
        location: '广东省汕尾市陆丰市甲东镇',
        position: [116.1338, 22.8768],
    },
    8818: {
        location: '广东省汕尾市海丰县鲘门镇',
        position: [115.0883, 22.8064],
    },
    8822: { location: '海南省万宁市南桥镇', position: [110.1534, 18.6849] },
    8823: { location: '海南省万宁市东澳镇', position: [110.3886, 18.7954] },
    8903: {
        location: '广东省江门市台山市海宴镇',
        position: [112.5906, 21.834],
    },
    8905: { location: '海南省三亚市海棠区', position: [109.7129, 18.3337] },
    8907: { location: '海南省文昌市龙楼镇', position: [110.9615, 19.6516] },
    8908: {
        location: '广东省阳江市阳西县上洋镇',
        position: [111.5775, 21.591],
    },
    8909: {
        location: '浙江省宁波市象山县石浦镇',
        position: [121.9348, 29.2279],
    },
    8912: { location: '上海市浦东新区合庆镇', position: [121.7213, 31.2365] },
    8918: {
        location: '福建省福州市连江县筱埕镇',
        position: [119.7734, 26.3109],
    },
    8920: {
        location: '浙江省台州市温岭市松门镇',
        position: [121.6332, 28.3808],
    },
    8923: {
        location: '海南省陵水黎族自治县黎安镇',
        position: [110.0313, 18.4249],
    },
    8926: {
        location: '海南省三亚市亚龙湾度假区',
        position: [109.6396, 18.2341],
    },
    9003: { location: '台湾省台南市安平区', position: [120.167, 22.9846] },
    9004: {
        location: '广东省湛江市徐闻县新寮镇',
        position: [110.4595, 20.6255],
    },
    9005: {
        location: '福建省宁德市福鼎市沙埕镇',
        position: [120.4161, 27.1636],
    },
    9006: {
        location: '福建省漳州市漳浦县古雷镇',
        position: [117.6224, 23.8029],
    },
    9009: {
        location: '广东省汕尾市捷胜镇沿海地区',
        position: [115.4344, 22.7131],
    },
    9012: {
        location: '福建省莆田市秀屿区东埔镇',
        position: [119.0634, 25.1478],
    },
    9016: {
        location: '浙江省台州市椒江区海门镇',
        position: [121.4386, 28.6759],
    },
    9017: {
        location: '福建省宁德市霞浦县三沙镇',
        position: [120.2179, 26.926],
    },
    9018: {
        location: '福建省厦门市湖里区沿海地区',
        position: [118.1421, 24.5146],
    },
    9027: { location: '海南省三亚市崖城镇', position: [109.1677, 18.3592] },
    9103: { location: '海南省万宁市南桥镇', position: [110.1534, 18.6849] },
    9106: { location: '海南省万宁市东澳镇', position: [110.3886, 18.7954] },
    9107: {
        location: '广东省汕头市潮阳区海门镇',
        position: [116.6106, 23.186],
    },
    9108: {
        location: '广东省珠海市金湾区南水镇',
        position: [113.2353, 22.0294],
    },
    9112: {
        location: '广东省湛江市徐闻县前山镇',
        position: [110.4418, 20.3965],
    },
    9116: {
        location: '广东省汕尾市海丰县圆墩乡',
        position: [115.0484, 22.835],
    },
    9120: {
        location: '广东省潮州市饶平县大埕镇',
        position: [117.1562, 23.6207],
    },
    9204: {
        location: '海南省陵水黎族自治县英州镇',
        position: [109.8592, 18.4488],
    },
    9206: { location: '海南省琼海市潭门镇', position: [110.6116, 19.2422] },
    9207: {
        location: '广东省珠海市金湾区横琴镇',
        position: [113.5023, 22.1156],
    },
    9208: {
        location: '广东省湛江市麻章区东简镇',
        position: [110.493, 21.0168],
    },
    9214: {
        location: '广东省潮州市饶平县大埕镇',
        position: [117.1562, 23.6207],
    },
    9216: {
        location: '福建省厦门市思明区沿海地区',
        position: [118.077, 24.4482],
    },
    9217: {
        location: '福建省福州市福清市东瀚镇',
        position: [119.6177, 25.4069],
    },
    9220: {
        location: '浙江省温州市平阳县西湾风景区',
        position: [120.6422, 27.6451],
    },
    9302: {
        location: '广东省阳江市江城区海陵镇',
        position: [111.9333, 21.628],
    },
    9303: { location: '海南省三亚市海棠区', position: [109.7129, 18.3337] },
    9310: {
        location: '广东省阳江市阳西县上洋镇',
        position: [111.5775, 21.591],
    },
    9316: {
        location: '广东省揭阳市惠来县前詹镇',
        position: [116.4125, 22.9719],
    },
    9317: {
        location: '广东省江门市台山市赤溪镇',
        position: [112.9844, 21.9936],
    },
    9318: {
        location: '广东省江门市台山市那琴半岛',
        position: [112.7889, 22.2545],
    },
    9324: {
        location: '广东省阳江市江城区海陵镇',
        position: [111.9333, 21.628],
    },
    9403: { location: '台湾省台北市贡寮乡', position: [121.5097, 25.0601] },
    9404: {
        location: '广东省阳江市阳西县溪头镇',
        position: [111.7527, 21.6557],
    },
    9405: {
        location: '福建省泉州市惠安县张坂镇',
        position: [118.8116, 24.9106],
    },
    9412: {
        location: '福建省漳州市龙海市隆教畲族乡',
        position: [118.0584, 24.2591],
    },
    9413: {
        location: '江苏省南通市如东县长沙镇',
        position: [121.283, 32.4093],
    },
    9414: {
        location: '山东省威海市文登区泽库镇',
        position: [122.0566, 36.9374],
    },
    9416: {
        location: '浙江省温州市龙湾区海城镇',
        position: [120.7563, 27.8311],
    },
    9417: {
        location: '福建省福州市福清市东瀚镇',
        position: [119.6177, 25.4069],
    },
    9418: {
        location: '广东省湛江市徐闻县前山镇',
        position: [110.4418, 20.3965],
    },
    9421: { location: '海南省三亚市天涯镇', position: [109.4174, 18.3007] },
    9423: { location: '海南省万宁市山根镇', position: [110.4822, 18.9691] },
    9502: { location: '台湾省台南市北门乡', position: [121.9637, 24.084] },
    9504: {
        location: '广东省汕头市澄海区坝头镇',
        position: [116.8238, 23.443],
    },
    9505: {
        location: '广东省惠州市惠阳区澳头镇',
        position: [114.5362, 22.7186],
    },
    9506: {
        location: '广西省北海市银海区咸田镇',
        position: [109.1454, 21.4114],
    },
    9507: { location: '浙江省台州市温岭市石塘镇', position: [121.6029, 28.28] },
    9508: {
        location: '海南省陵水黎族自治县黎安镇',
        position: [110.0313, 18.4249],
    },
    9509: {
        location: '广东省汕尾市海丰县小漠镇',
        position: [115.0174, 22.7558],
    },
    9511: {
        location: '广东省湛江市徐闻县下洋镇',
        position: [110.4755, 20.4898],
    },
    9515: {
        location: '广东省茂名市电白县爵山镇',
        position: [111.3356, 21.4978],
    },
    9516: {
        location: '广西省北海市合浦县西场镇',
        position: [108.9185, 21.6818],
    },
    9521: {
        location: '海南省三亚市亚龙湾度假区',
        position: [109.6396, 18.2341],
    },
    9606: { location: '海南省万宁市东澳镇', position: [110.3886, 18.7954] },
    9607: {
        location: '福建省泉州市南安市石井镇',
        position: [118.3819, 24.6337],
    },
    9608: {
        location: '福建省福州市平潭县敖东镇',
        position: [119.7319, 25.4305],
    },
    9611: {
        location: '福建省漳州市东山县陈城镇',
        position: [117.3898, 23.623],
    },
    9612: { location: '海南省三亚市海棠区', position: [109.7129, 18.3337] },
    9615: {
        location: '广东省湛江市吴川市吴阳镇',
        position: [110.6616, 21.3152],
    },
    9618: {
        location: '广东省湛江市徐闻县下洋镇',
        position: [110.4755, 20.4898],
    },
    9713: { location: '香港特别行政区', position: [114.1746, 22.2907] },
    9714: { location: '浙江省台州市温岭市石塘镇', position: [121.6029, 28.28] },
    9716: {
        location: '广东省湛江市徐闻县新寮镇',
        position: [110.4595, 20.6255],
    },
    9717: {
        location: '福建省福州市平潭县敖东镇',
        position: [119.7319, 25.4305],
    },
    9801: {
        location: '福建省漳州市龙海市港尾镇',
        position: [118.0797, 24.3423],
    },
    9802: {
        location: '福建省福州市福清市东瀚镇',
        position: [119.6177, 25.4069],
    },
    9803: {
        location: '广东省茂名市电白县爵山镇',
        position: [111.3356, 21.4978],
    },
    9806: {
        location: '浙江省舟山市普陀区朱家尖',
        position: [122.3858, 29.9169],
    },
    9903: {
        location: '广东省惠州市惠东县平海镇',
        position: [114.8681, 22.6204],
    },
    9904: {
        location: '广东省江门市台山市赤溪镇',
        position: [112.9844, 21.9936],
    },
    9907: {
        location: '山东省日照市东港区两城镇',
        position: [119.5655, 35.5757],
    },
    9909: { location: '香港特别行政区', position: [114.1746, 22.2907] },
    9913: {
        location: '广东省揭阳市惠来县前詹镇',
        position: [116.4125, 22.9719],
    },
    9914: {
        location: '广东省珠海市香洲区吉大沿海',
        position: [113.5731, 22.2531],
    },
    9918: { location: '香港特别行政区', position: [114.1746, 22.2907] },
    9919: {
        location: '福建省漳州市龙海市隆教畲族乡',
        position: [118.0584, 24.2591],
    },
    4903: {
        location: '广东省广州市南沙区新垦镇',
        position: [113.6681, 22.6339],
    },
};
